# The powerlevel10k theme
romkatv/powerlevel10k

# Automatic suggestions like the fish shell
zsh-users/zsh-autosuggestions

# Completions
zsh-users/zsh-completions
ohmyzsh/ohmyzsh path:plugins/composer
ohmyzsh/ohmyzsh path:plugins/laravel
ohmyzsh/ohmyzsh path:plugins/redis-cli


# These two MUST be the last plugins to be sourced!
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search